In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql

In [3]:
db_connection_str = 'mysql+pymysql://root:cualquiera@192.168.0.16/acme_company'
db_connection = create_engine(db_connection_str)

In [4]:
df = pd.read_sql('SELECT * FROM employees', con=db_connection)

In [5]:
df.head()

,employee_id,first_name,last_name,email,company_id,country_id,department_id,evaluations_id,gender_id,job_id
0,1,Lin,Ksandra,lksandra0@noaa.gov,3,4,6,4,2,3
1,2,Kirsten,Leighton,kleighton1@stumbleupon.com,9,6,9,4,1,4
2,3,Doll,Rumsby,drumsby2@ask.com,8,2,3,2,1,6
3,4,Meagan,Oxenden,moxenden3@ifeng.com,13,6,2,1,1,10
4,5,Gregoire,Treharne,gtreharne4@unesco.org,2,1,3,5,2,10